### Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [1]:
import pandas as pd
import numpy as np

In [2]:
from env import host, user, password
def get_db_url(user, password, host, database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'
url = get_db_url(user, password, host, 'employees')

In [ ]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

### Once you have successfully run a query:

#### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [ ]:
get_db_url = f'mysql+pymysql://{user}:{password}@{host}/emlyees'
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', get_db_url)

In [ ]:
The error tells me that my access was denied

#### b. Intentionally make an error in your SQL query. What does the error message look like?

In [ ]:
pd.read_sql('SELECT * FROM employes LIMIT 5 OFFSET 50', url)

The error tells me that the table does not exist

#### Read the employees and titles tables into two separate DataFrames.

In [ ]:
get_db_url = f'mysql+pymysql://{user}:{password}@{host}/employees'
employees = pd.read_sql('SELECT * FROM employees', get_db_url)

In [ ]:
get_db_url = f'mysql+pymysql://{user}:{password}@{host}/employees'
titles = pd.read_sql('SELECT * FROM titles', get_db_url)

#### How many rows and columns do you have in each DataFrame? Is that what you expected?

In [ ]:
titles.shape

In [ ]:
employees.shape

The employees table is (300024 x 6) and the titles table is (443308 x 4)

#### Display the summary statistics for each DataFrame.

In [ ]:
employees.info()
employees.describe()

In [ ]:
titles.info()
titles.describe()

#### How many unique titles are in the titles DataFrame?

In [ ]:
len(titles.title.value_counts())

There are 7 unique titles in the title df

#### What is the oldest date in the to_date column?

In [ ]:
titles.to_date.sort_values().head(1)

The oldest date is March 11, 1985

#### What is the most recent date in the to_date column?

In [ ]:
todate = titles.to_date.unique()
np.sort(todate)

The most recent date is August 1, 2002

In [ ]:
pd.read_sql('SELECT * FROM titles WHERE to_date < NOW() ORDER BY to_date DESC LIMIT 5', url)

### Exercise 2

In [ ]:
from pydataset import data
import pandas as pd
import numpy as np

#### 1. Copy the users and roles DataFrames from the examples above.

In [ ]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

In [ ]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

#### 2. What is the result of using a right join on the DataFrames?

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)

In [ ]:
roles.merge(users, left_on='id', right_on='role_id', how='right', indicator=True)

#### 3. What is the result of using an outer join on the DataFrames?

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

In [ ]:
roles.merge(users, left_on='id', right_on='role_id', how='outer', indicator=True)

#### 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
users.merge(roles, how='outer', indicator=True)

#### 5. Load the mpg dataset from PyDataset.

In [ ]:
mpg = data('mpg')

#### 6. Output and read the documentation for the mpg dataset.

In [ ]:
mpg

#### 7. How many rows and columns are in the dataset?

In [ ]:
mpg.shape

#### 8. Check out your column names and perform any cleanup you may want on them.

In [ ]:
mpg.columns
mpg = mpg.rename(columns={'fl': 'fuel'})

#### 9. Display the summary statistics for the dataset.

In [ ]:
mpg.describe()

In [ ]:
mpg.info()

#### 10. How many different manufacturers are there?

In [ ]:
mpg.manufacturer.value_counts()
len(mpg.manufacturer.value_counts())

#### 11. How many different models are there?

In [ ]:
mpg.model.value_counts()
len(mpg.model.value_counts())

#### 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
mpg['mileage_difference'] = (mpg.hwy - mpg.cty)

In [ ]:
mpg

#### 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
mpg['average_mileage'] = round((mpg.cty + mpg.hwy) / 2, 2)

In [ ]:
mpg

#### 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
mpg['is_automatic'] = mpg.trans.str.startswith("auto")

In [ ]:
mpg

#### 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
mpg.groupby('manufacturer').average_mileage.agg('mean').sort_values().tail(1)

#### 16. Do automatic or manual cars have better miles per gallon?

In [ ]:
mpg.groupby('is_automatic').average_mileage.agg(['mean', 'max', 'min', 'count'])

On average, manuals get better mileage

### Exercise 3

#### 1. Use your get_db_url function to help you explore the data from the chipotle database.

In [61]:
from env import host, user, password
def get_db_url(user, password, host, database):
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'
url = get_db_url(user, password, host, 'chipotle')

In [62]:
orders = pd.read_sql('SELECT * FROM orders', url)
orders[orders.item_name == "Chicken Bowl"]

,id,order_id,quantity,item_name,choice_description,item_price
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
13,14,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
19,20,10,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$8.75
26,27,13,1,Chicken Bowl,"[Roasted Chili Corn Salsa (Medium), [Pinto Bea...",$8.49
...,...,...,...,...,...,...
4590,4591,1825,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Black Beans,...",$11.25
4591,4592,1825,1,Chicken Bowl,"[Tomatillo Red Chili Salsa, [Rice, Black Beans...",$8.75
4595,4596,1826,1,Chicken Bowl,"[Tomatillo Green Chili Salsa, [Rice, Black Bea...",$8.75
4599,4600,1827,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Cheese, Lettuce]]",$8.75
4604,4605,1828,1,Chicken Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",$8.75

#### 2. What is the total price for each order?

In [63]:
orders['item_prices'] = orders.item_price.str.replace('$', '').astype(float)
orders.groupby('order_id').item_prices.sum()

<ipython-input-63-a9d5e3d2e9ae>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  orders['item_prices'] = orders.item_price.str.replace('$', '').astype(float)

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_prices, Length: 1834, dtype: float64

#### 3. What are the most popular 3 items?

In [70]:
orders.item_name.value_counts().head(3)

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: item_name, dtype: int64

#### 4. Which item has produced the most revenue?

In [71]:
orders.groupby('item_name').item_prices.sum().sort_values().tail(1)

item_name
Chicken Bowl    7342.73
Name: item_prices, dtype: float64

#### 5. Join the employees and titles DataFrames together.

In [ ]:
get_db_url = f'mysql+pymysql://{user}:{password}@{host}/employees'
titles = pd.read_sql('SELECT * FROM titles', get_db_url)
employees = pd.read_sql('SELECT * FROM employees', get_db_url)

In [ ]:
employees

In [ ]:
titles

In [ ]:
emp_titles = employees.merge(titles, on='emp_no', how='outer', indicator=True)

In [ ]:
emp_titles

#### 6. For each title, find the hire date of the employee that was hired most recently with that title.

In [29]:
emp_titles.groupby('title').hire_date.max()

title
Assistant Engineer    1999-12-24
Engineer              2000-01-28
Manager               1992-02-05
Senior Engineer       2000-01-01
Senior Staff          2000-01-13
Staff                 2000-01-12
Technique Leader      1999-12-31
Name: hire_date, dtype: object

#### 7. Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [55]:
dept_emp = pd.read_sql('SELECT * FROM dept_emp WHERE to_date > NOW()', get_db_url)
titles = pd.read_sql('SELECT * FROM titles WHERE to_date > NOW()', get_db_url)
dept = pd.read_sql('SELECT * FROM departments', get_db_url)

In [56]:
td = titles.merge(dept_emp, on='emp_no', how='outer', indicator=True)
de_total = td.merge(dept, on='dept_no', how='outer')

In [59]:
pd.crosstab(de_total.title, de_total.dept_name, margins=True)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales,All
title,,,,,,,,,,
Assistant Engineer,68,1652,0,0,0,1402,389,77,0,3588
Engineer,627,14040,0,0,0,12081,3405,830,0,30983
Manager,1,1,1,1,1,1,1,1,1,9
Senior Engineer,1790,38816,0,0,0,33625,9458,2250,0,85939
Senior Staff,11268,1085,9545,9824,11290,1123,0,9092,28797,82024
Staff,3574,315,2891,3073,3551,349,0,2870,8903,25526
Technique Leader,241,5477,0,0,0,4723,1293,321,0,12055
All,17569,61386,12437,12898,14842,53304,14546,15441,37701,240124